Repository: dstufft/django-passwords
Catalog: passwords/locale/*/LC_MESSAGES/django.po
Languages: de, fr, ja

source: %i to %i characters
de: Zwischen %i und %i Zeichen
fr: %i à %i caractères

source: %i characters minimum
de: Mindestens %i Zeichen
fr: %i caractères minimum

source: Invalid Length (%s)
de: Ungültige Länge (%s)
fr: Taille invalide (%s)
ja: 無効な長さです (%s)

source: Must be %s characters or more
de: Es müssen %s oder mehr Zeichen enthalten sein
fr: Doit faire %s caractères ou plus
ja: %s文字以上でご入力ください

source: Must be %s characters or less
de: Es müssen %s oder weniger Zeichen enthalten sein
fr: Doit faire %s caractères ou moins
ja: %s文字以下でご入力ください

source: Must be more complex (%s)
de: Höhere Komplexität erforderlich (%s)
fr: Doit être plus complexe (%s)
ja: 複雑なパスワードをご入力ください (%s)

source: must contain %(UPPER)s or more unique uppercase characters
de: Es müssen %(UPPER)s oder mehr verschiedene Großbuchstaben vorhanden sein
fr: doit contenir %(UPPER)s caractères en majuscule uniques ou plus
ja: %(UPPER)s文字以上の大文字をご入力ください

source: must contain %(LOWER)s or more unique lowercase characters
de: Es müssen %(LOWER)s oder mehr verschiedene Kleinbuchstaben vorhanden sein
fr: doit contenir %(LOWER)s caractères en minuscule uniques ou plus
ja: %(LOWER)s文字以上の小文字をご入力ください

source: must contain %(LETTERS)s or more unique letters
de: Es müssen %(LETTERS)s oder mehr verschiedene Buchstaben vorhanden sein
fr: doit contenir %(LETTERS)s lettres uniques ou plus
ja: %(LETTERS)s文字以上の大文字または小文字をご入力ください

source: must contain %(DIGITS)s or more unique digits
de: Es müssen %(DIGITS)s oder mehr verschiedene Zahlen vorhanden sein
fr: doit contenir %(DIGITS)s digits uniques ou plus
ja: %(DIGITS)s文字以上の数字をご入力ください

source: must contain %(PUNCTUATION)s or more unique punctuation characters: %%s
de: Es müssen %(PUNCTUATION)s oder mehr verschiedene Satzzeichen enthalten sein: %%s
fr: doit contenir %(PUNCTUATION)s caractères de ponctuation uniques ou plus : %%s
ja: %(PUNCTUATION)s文字以上の記号をご入力ください

source: must contain %(SPECIAL)s or more non unique special characters
de: Es müssen %(SPECIAL)s oder mehr Sonderzeichen enthalten sein
fr: doit contenir %(SPECIAL)s caractères spéciaux non uniques ou plus
ja: %(SPECIAL)s文字以上のスペースまたは記号をご入力ください

source: must contain %(WORDS)s or more unique words
de: Es müssen %(WORDS)s oder mehr verschiedene Wörter enthalten sein
fr: doit contenir %(WORDS)s mots uniques ou plus
ja: %(WORDS)s語以上の単語をご入力ください

source: Too Similar to [%(haystacks)s]
de: Zu ähnlich zu [%(haystacks)s]
fr: Trop similaire à [%(haystacks)s]
ja: [%(haystacks)s]と似すぎています

source: Based on a dictionary word
de: Basiert auf einem Wort im Wörterbuch
fr: Basé sur un mot du dictionnaire
ja: 辞書語が含まれています

source: Based on a common sequence of characters
de: Basiert auf einer verbreiteten Sequenz von Buchstaben
fr: Basé sur une séquence commune de caractères
ja: 推測しやすい文字の並びが含まれています
